---@meta





---@alias SpellAttackSpeedAttribute string
---| "技能点"


---
---单位属性
---
---@alias UnitAttribute string
---| "技能点"
---| "死亡经验"
---| "攻击范围"
---| "暴击"
---| "吸血"
---| "转身速度"
---| "减耗"
---| "等级"
---| "生命"
---| "高度"
---| "护盾"
---| "魔抗"
---| "穿透"
---| "格挡"
---| "经验"
---| "攻击"
---| "移动速度"
---| "视野遮挡范围"
---| "视野范围"
---| "法术穿透"
---| "法术破甲"
---| "等级上限"
---| "是否存活"
---| "最小转身速度"
---| "冷却缩减"
---| "最大转身速度"
---| "sys_unit_mark_ex"
---| "闪避"
---| "搜敌范围"
---| "重置距离"
---| "隐藏血条"
---| "追逐距离"
---| "魔法上限"
---| "攻击速度"
---| "升级所需经验"
---| "破甲"
---| "护甲"
---| "急速"
---| "单位标记"
---| "暴击伤害"
---| "剩余经验"
---| "魔法"
---| "魔法恢复"
---| "生命上限"
---| "生命恢复"
---

---@alias 单位属性子类型 number
---| "百分比"
---| "固定值"
---| "额外百分比"

---
---单位数值属性类型
---
---@alias UnitPropertySubType
---| 0      # 最终值
---| 1      # 基础值
---| 2      # 百分比变化值



---
---单位数值属性加成
---
---@class UnitPropertyBonus
---
---属性
---
---@field Key UnitAttribute
---
---值
---
---@field Value number
---
---子属性
---
---@field Percentage 单位属性子类型
---
---


---
---单位字符串属性
---
---@alias UnitStringAttribute string
---| "骑乘目标绑点"
---| "附着目标绑点"
---| "昵称"
---| "骑乘动画"
---| "CustomString"
---

